#3. Заголовок
#Дано: текст любой длины.
#Задание: написать программу, которая выведет заголовок, используя заданный текст.

print('Введите текст:')
s = input()
print(str.title(s))