#4. Форматированный вывод денежной суммы
#Дано: денежная сумма (amount > 0).

#Задание: написать программу, которая распечатает число в принятом денежном формате XXX,XXX.XX.

#Пример: amount = 100500.157; результат = 100,500.16
print('Введите число для конвертации в сумму:')
am = input()
print('{:,.2f}'.format(float(am)))