#2. Деление и еще раз деление
#Дано: 2 случайных числа.

#Задание: написать программу, которая будет печать результат целочисленного деления этих чисел, а также остаток от деления первого от второго.

from random import randint

x = randint(1, 100)
y = randint(1, 100)

print('Великим рандомом выбраны числа', x,'и', y,'результат их целочисленного деления равен', x//y,
      ',\nа остаток от деления первого числа на второе равен ',x%y)