# 1. Среднее
# Дано: 3 случайных числа.
#
# Задание: написать программу, которая будет вычислять среднее значение этих чисел.

from random import randint

x = randint(-100, 100)
y = randint(0, 10)
z = randint(-21, 156)

print('Великим рандомом выбраны числа', x, y ,z,', их среднее равно ', ('{0:.4}'.format((x+y+z)/3)))
