# 1. Fizz Buzz
# Дано: Число, как целочисленное (int).
# Задание:
# "Fizz buzz" это игра со словами, с помощью которой мы будем учить наших роботов делению. Давайте обучим компьютер.

# Вы должны написать программу, которая принимает положительное целое число и возвращает сл. значения.
#
# "Fizz Buzz", если число делится на 3 и 5;
# "Fizz", если число делится на 3;
# "Buzz", если число делится на 5;

# это первый вариант решения, второй находится в файле "task1v2"

print ('Поиграем в Fizz Buzz! Будет весело (или нет, не мои проблемы) ')
print ('Введите число: ')
x = input()
if (int(x)%3 == 0) & (int(x)%5 == 0):
    print('FIZZ BUZZ')
elif int(x)%3 == 0:
    print('fizz')
elif int(x)%5 == 0:
    print ('buzz')
else:
    print('Не фортануло с числом ', x,', попробуй другое')
