#Дано: Число N = [1-9].

#Задание: нужно написать программу, которая выведет последовательность 123..N

#Пример:

# N = 3, результат: 123
# N = 9, результат: 123456789
 # N = 1, результат: 1

print ('Вывод последовательности от 1 до N, где N = [1;9]')
print ('Введите N')
N = input()
N = int(N)
if (int(N) < 1 or int(N) > 9):
    print ('Написано же: от 1 до 9')
    exit()

for i in range(N+1):
    if i == 0: continue
    print (i, end = "")