#1. Welcome to Python
#Дано: имя и фамилия.

#Задание: написать программу, которая будет приветствовать нового человека в мире Python.
#Текст приветсвия: Hello NAME SURNAME! You just delved into Python. Great start!
print('Enter your name>>')
name = input()
print('Hello',name,'! You just delved into Python. Great start!')