#2. Оценка числа
#Дано: Число x.

#Задание: нужно написать программу, которая дает оценку заданному значению, используя следующие правила:

#если x нечетное, то это "Плохо"
#если x = [2, 5] и четное, то это "Неплохо"
#если x = [6, 20] и четное, то это "Так себе"
#если x > 20 и четное, то это "Отлично"

print ('Оцениваем числа')
print ('Введите число: ')
x = input()
res = ('Плохо' if int(x)%2 == 1 else
       'Неплохо' if int(x) >= 2 and int(x) <= 5 else
       'Так себе' if int(x) >= 6 and int(x) <= 20 else
       'Отлично')
print (res);
