#Дано: Дан кусок текста (str).

#Задание: Соберите все заглавные буквы в одно слово в том порядке как они встречаются в куске текста.
# Подсказка: посмотрите внимательно на методы класса str.

#Пример:
# текст = "How are you? Eh, ok. Low or Lower? Ohhh.", если мы соберем все заглавные буквы, то получим сообщение "HELLO".
print('Сейчас прочитаем великий шифр. Введите шифрованное сообщение:')
message = input()

for i in message:
    if str.istitle(i):
        print (i, end = "")